In [1]:
import pandas as pd
import numpy as np

**1. Show installed versions**

In [2]:
pd.show_versions()

INSTALLED VERSIONS
------------------
commit           : 06d230151e6f18fdb8139d09abf539867a8cd481
python           : 3.10.0.final.0
python-bits      : 64
OS               : Windows
OS-release       : 10
Version          : 10.0.19044
machine          : AMD64
processor        : Intel64 Family 6 Model 158 Stepping 10, GenuineIntel
byteorder        : little
LC_ALL           : None
LANG             : pl_PL.UTF-8
LOCALE           : Polish_Poland.1250

pandas           : 1.4.1
numpy            : 1.22.1
pytz             : 2021.3
dateutil         : 2.8.2
pip              : 21.3.1
setuptools       : 57.4.0
Cython           : None
pytest           : None
hypothesis       : None
sphinx           : None
blosc            : None
feather          : None
xlsxwriter       : None
lxml.etree       : None
html5lib         : None
pymysql          : None
psycopg2         : None
jinja2           : 3.0.3
IPython          : 8.1.1
pandas_datareader: None
bs4              : 4.10.0
bottleneck       : None
fastparquet      : None
fsspec           : None
gcsfs            : None
matplotlib       : 3.5.1
numba            : None
numexpr          : None
odfpy            : None
openpyxl         : None
pandas_gbq       : None
pyarrow          : None
pyreadstat       : None
pyxlsb           : None
s3fs             : None
scipy            : 1.8.0
sqlalchemy       : None
tables           : None
tabulate         : None
xarray           : None
xlrd             : None
xlwt             : None
zstandard        : None

**2. Create an example DataFrame**

In [7]:
df = pd.DataFrame(np.random.rand(4, 8), columns=list('abcdefgh')) # by using np random rand function we pass (rows, columns)
# it will generate 2 dimensional array which can be interpreted by pandas as a dataframe. We can pass also the column names
# so it will be more readable

**3. Rename columns**

In [8]:
df.head()

,a,b,c,d,e,f,g,h
0,0.441637,0.954892,0.733134,0.435041,0.640679,0.567765,0.523996,0.965108
1,0.311862,0.971079,0.739715,0.821916,0.533773,0.755704,0.715776,0.181956
2,0.632200,0.943685,0.490780,0.846505,0.565000,0.263891,0.526235,0.889685
3,0.872253,0.299259,0.311723,0.570059,0.419355,0.314112,0.024902,0.248143

In [10]:
df.rename({'a':'a1', 'b':'b1'}, axis=1) # the most flexible

,a1,b1,c,d,e,f,g,h
0,0.441637,0.954892,0.733134,0.435041,0.640679,0.567765,0.523996,0.965108
1,0.311862,0.971079,0.739715,0.821916,0.533773,0.755704,0.715776,0.181956
2,0.632200,0.943685,0.490780,0.846505,0.565000,0.263891,0.526235,0.889685
3,0.872253,0.299259,0.311723,0.570059,0.419355,0.314112,0.024902,0.248143

In [14]:
df.columns = list('hgfedcba') # the fastest? to overwrite existing names, we pass a list with exact length

In [15]:
df.head()

,h,g,f,e,d,c,b,a
0,0.441637,0.954892,0.733134,0.435041,0.640679,0.567765,0.523996,0.965108
1,0.311862,0.971079,0.739715,0.821916,0.533773,0.755704,0.715776,0.181956
2,0.632200,0.943685,0.490780,0.846505,0.565000,0.263891,0.526235,0.889685
3,0.872253,0.299259,0.311723,0.570059,0.419355,0.314112,0.024902,0.248143

If we have column names with spaces inside and we do not really want that, we can use this trick

In [24]:
df.rename({'h':'ha ha'},axis=1, inplace=True)

In [25]:
df.head()

,ha ha,g,f,e,d,c,b,a
0,0.441637,0.954892,0.733134,0.435041,0.640679,0.567765,0.523996,0.965108
1,0.311862,0.971079,0.739715,0.821916,0.533773,0.755704,0.715776,0.181956
2,0.632200,0.943685,0.490780,0.846505,0.565000,0.263891,0.526235,0.889685
3,0.872253,0.299259,0.311723,0.570059,0.419355,0.314112,0.024902,0.248143

In [28]:
df.columns = df.columns.str.replace(' ', '_')

In [30]:
df.head()

,ha_ha,g,f,e,d,c,b,a
0,0.441637,0.954892,0.733134,0.435041,0.640679,0.567765,0.523996,0.965108
1,0.311862,0.971079,0.739715,0.821916,0.533773,0.755704,0.715776,0.181956
2,0.632200,0.943685,0.490780,0.846505,0.565000,0.263891,0.526235,0.889685
3,0.872253,0.299259,0.311723,0.570059,0.419355,0.314112,0.024902,0.248143

If we want to add a suffix/prefix

In [31]:
df.add_prefix('x_')

,x_ha_ha,x_g,x_f,x_e,x_d,x_c,x_b,x_a
0,0.441637,0.954892,0.733134,0.435041,0.640679,0.567765,0.523996,0.965108
1,0.311862,0.971079,0.739715,0.821916,0.533773,0.755704,0.715776,0.181956
2,0.632200,0.943685,0.490780,0.846505,0.565000,0.263891,0.526235,0.889685
3,0.872253,0.299259,0.311723,0.570059,0.419355,0.314112,0.024902,0.248143

In [32]:
df.add_suffix('_y')

,ha_ha_y,g_y,f_y,e_y,d_y,c_y,b_y,a_y
0,0.441637,0.954892,0.733134,0.435041,0.640679,0.567765,0.523996,0.965108
1,0.311862,0.971079,0.739715,0.821916,0.533773,0.755704,0.715776,0.181956
2,0.632200,0.943685,0.490780,0.846505,0.565000,0.263891,0.526235,0.889685
3,0.872253,0.299259,0.311723,0.570059,0.419355,0.314112,0.024902,0.248143

**4. Reverse row order**

In [33]:
df.head()

,ha_ha,g,f,e,d,c,b,a
0,0.441637,0.954892,0.733134,0.435041,0.640679,0.567765,0.523996,0.965108
1,0.311862,0.971079,0.739715,0.821916,0.533773,0.755704,0.715776,0.181956
2,0.632200,0.943685,0.490780,0.846505,0.565000,0.263891,0.526235,0.889685
3,0.872253,0.299259,0.311723,0.570059,0.419355,0.314112,0.024902,0.248143

In [35]:
df.loc[::-1] # reversed order (index also)

,ha_ha,g,f,e,d,c,b,a
3,0.872253,0.299259,0.311723,0.570059,0.419355,0.314112,0.024902,0.248143
2,0.632200,0.943685,0.490780,0.846505,0.565000,0.263891,0.526235,0.889685
1,0.311862,0.971079,0.739715,0.821916,0.533773,0.755704,0.715776,0.181956
0,0.441637,0.954892,0.733134,0.435041,0.640679,0.567765,0.523996,0.965108

In [38]:
df.loc[::-1].reset_index(drop=True) # reversed order with index reset

,ha_ha,g,f,e,d,c,b,a
0,0.872253,0.299259,0.311723,0.570059,0.419355,0.314112,0.024902,0.248143
1,0.632200,0.943685,0.490780,0.846505,0.565000,0.263891,0.526235,0.889685
2,0.311862,0.971079,0.739715,0.821916,0.533773,0.755704,0.715776,0.181956
3,0.441637,0.954892,0.733134,0.435041,0.640679,0.567765,0.523996,0.965108

**5. Reverse column order**

In [40]:
df.loc[:, ::-1] # works the same as row reverse

,a,b,c,d,e,f,g,ha_ha
0,0.965108,0.523996,0.567765,0.640679,0.435041,0.733134,0.954892,0.441637
1,0.181956,0.715776,0.755704,0.533773,0.821916,0.739715,0.971079,0.311862
2,0.889685,0.526235,0.263891,0.565000,0.846505,0.490780,0.943685,0.632200
3,0.248143,0.024902,0.314112,0.419355,0.570059,0.311723,0.299259,0.872253

**6. Select columns by data type**

In [41]:
train_df = pd.DataFrame({'name':['Josh','John','Anna','Bernie'], 'age':[20, 21, 51, 31], 'payment':[512.93, 321.12, 866, 9412.93]})

In [42]:
train_df

     name  age  payment
0    Josh   20   512.93
1    John   21   321.12
2    Anna   51   866.00
3  Bernie   31  9412.93

In [44]:
train_df.select_dtypes(include='number')

   age  payment
0   20   512.93
1   21   321.12
2   51   866.00
3   31  9412.93

In [45]:
train_df.select_dtypes(include='object')

     name
0    Josh
1    John
2    Anna
3  Bernie

In [46]:
train_df.select_dtypes(include=['object', 'number'])

     name  age  payment
0    Josh   20   512.93
1    John   21   321.12
2    Anna   51   866.00
3  Bernie   31  9412.93

In [47]:
train_df.select_dtypes(exclude='object')

   age  payment
0   20   512.93
1   21   321.12
2   51   866.00
3   31  9412.93

**7. Convert string to numbers**

In [55]:
train_df['fav_number'] = ['7','25','51','88']
train_df['bad_number'] = ['51', '22','67','t']

In [56]:
train_df.dtypes #fav_number is object (string)

name           object
age             int64
payment       float64
fav_number     object
bad_number     object
dtype: object

In [69]:
train_df = train_df.astype({'fav_number':'int'}) # cast pandas object to specific dtype, prone to errors

In [70]:
train_df.dtypes

name           object
age             int64
payment       float64
fav_number      int32
bad_number     object
dtype: object

In [73]:
#train_df.astype({'bad_number':'int'}) # error because pandas does not know how to handle not "numeric" strings

In [77]:
pd.to_numeric(train_df.bad_number, errors='coerce') # tell pandas to handle these string and set them to NaN

0    51.0
1    22.0
2    67.0
3     NaN
Name: bad_number, dtype: float64

**8. Reduce DataFrame size**

In [78]:
drinks = pd.read_csv('http://bit.ly/drinksbycountry')

In [81]:
drinks.info(memory_usage='deep') # 30.5 KB

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     193 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 30.5 KB

In [83]:
cols_we_need = ['beer_servings', 'continent']
s_drinks = pd.read_csv('http://bit.ly/drinksbycountry', usecols=cols_we_need)

In [87]:
s_drinks.info(memory_usage='deep') # 13.7 KB, the point is to use only the columns that we actually need to do
# certain operations on

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   beer_servings  193 non-null    int64
 1   continent      193 non-null    object
dtypes: int64(1), object(1)
memory usage: 13.7 KB

In [90]:
dtypes = {'continent':'category'}
s_drinks = pd.read_csv('http://bit.ly/drinksbycountry', usecols=cols_we_need, dtype=dtypes)
s_drinks.info(memory_usage='deep') # 2.4 KB not only columns that we need but also try to change object-type data to categorical
# only if there are not many different values (for example not many countries to choose from)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 2 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   beer_servings  193 non-null    int64
 1   continent      193 non-null    category
dtypes: category(1), int64(1)
memory usage: 2.4 KB

**9. Build a DataFrame from multiple files (row-wise)**

In [91]:
from glob import glob # glob help us to take all filenames that match pattern from specified path.

In [92]:
files = sorted(glob('./data_2/concat_*')) # we have to sort the files

In [99]:
df = pd.concat((pd.read_csv(file) for file in files), ignore_index=True) # concat can take mapping and iterable so
# we take an adventage of that, we pass ignore_index = True to make sure that index numering starts and ends in normal way.

In [100]:
df

      A    B    C    D
0    a0   b0   c0   d0
1    a1   b1   c1   d1
2    a2   b2   c2   d2
3    a3   b3   c3   d3
4    a4   b4   c4   d4
5    a5   b5   c5   d5
6    a6   b6   c6   d6
7    a7   b7   c7   d7
8    a8   b8   c8   d8
9    a9   b9   c9   d9
10  a10  b10  c10  d10
11  a11  b11  c11  d11

**10. Build a DataFrame from multiple files (column-wise)**

If a data set has been split into two or more files (first file has some columns, the second some and so on...) we can use this trick to concate them into single data frame column wise.

In [101]:
# pd.concat((pd.read_csv(file) for file in files), axis='columns') The diffrence ist hat we specify columns and we
# do not care about index.

**11. Create a DataFrame from the clipboard**

In [108]:
df = pd.read_clipboard() # u have to copy from for example excel, select table, ctrl + c and you can use this function
# to paste it as a dataframe, wtf magic
# pandas can recognize patterns, by that i mean as long as the table in excel look like a data frame.

In [105]:
df

    A    B    C
0  10   20   30
1  25   35   45
2  55  100  145

In [106]:
df.dtypes

A    int64
B    int64
C    int64
dtype: object

**12. Split a DataFrame into two random subsets**